"""
TODO

Эмулятор биржи - берет файлы записанные и отправляет их данные по дельте между response_datetime начальной и текущей датой начальной.
Если response_datetime нет
Также эмулирует проскальзывание при выполнении ордера.
И др. вещи.
Не годится для оптимизации стратеги, но годится для прогона найденных параметров стратегии.



Сами биржи могут регистрировать отправку заявок и их исполнение и сохранять, или сохранять это в контролере - для оценки проскальзывания.
Или в сделках - все ключевые параметры.
"""


